#+SETUPFILE: ../etc/org_mode_SETUPFILE.org
#+Title: Atividade TLBD3 - Loja de Informática (store procedures)
** Rodando o script inteiro

  #+NAME: store procedures
  #+BEGIN_SRC sh :results output  :exports both
  docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/lojainfo_sqlserver_storeprocedures.sql
  #+END_SRC

  #+RESULTS: store procedures
  #+begin_example
  Changed database context to 'lojainfo'.
  ########## PRIMEIRA PROCEDURE (RECEBENDO PARAMETROS) ##########
  Mostrando como usa parametros no procedimento
  Desconto Minimo Desconto Maximo
  --------------- ---------------
            10.50           20.50

  (1 rows affected)
  Desconto Minimo Desconto Maximo
  --------------- ---------------
            10.50           20.50

  (1 rows affected)
  ########## SEGUNDA PROCEDURE (RECEBENDO PARAMETROS E RETORNANDO VALOR) ##########
  Mostrando como usa parametros no procedimento
  Preco Com Desconto
  ------------------
               50.00

  (1 rows affected)
  mostrando o resultado da procedure
  o vlr da variavel de output da procedure foi atribuido a nossa variavel @PrecoComDesconto
  Vlr da Variavel @PrecoComDesconto
  ---------------------------------
                              50.00

  (1 rows affected)
  ########## TERCEIRA PROCEDURE (USANDO VARS NOMEADAS NA CHAMADA DO PROC) ##########
  Mostrando  envio nos parï¿½metros nomeados...
  HResult 0x1FE2, Level 16, State 2
  The formal parameter "@pco" was not declared as an OUTPUT parameter, but the actual parameter passed in requested output.
  Again:Vlr da Variavel @PrecoComDesconto
  ---------------------------------------
                                    50.00

  (1 rows affected)
  ########## LIST PROCEDURES ##########
  name                                                                                                                             type
  -------------------------------------------------------------------------------------------------------------------------------- ----
  select_produtos_por_faixa_de_desconto                                                                                            P   
  aplica_desconto_no_preco                                                                                                         P   
  select_produtos_com_algum_desconto                                                                                               P   

  (3 rows affected)
  #+end_example



